/*Пешо Хакера си открил следната игра:
 *намислял си две цели числа a и b и две цифри p1 и p2.
 *След това записвал всички цели числа от интервала[a;b]
 *и задрасквал цифрите им, които се делят на p1 или на p2.
 *После преброявал колко цифри са останали незадраскани.
 *Например, при a = 15, b = 23, p1 = 2 и p2 = 3,
 *в интервала [15;23] има общо 8 цифри, които
 *не се делят на 2 или на 3:  15 16 17 18 19 20.
 *Напишете програма digit, която помага на г-н Хакера
 *за решаване на тази задача.*/

#include <iostream>
using namespace std;

int main()
{
    int a, b, p1, p2;
    cin >> a >> b >> p1 >> p2;
    int count = 0;

    for (int i = a; i <= b; i++)
    {
        int x = i;
        while (x > 0)
        {
            int digit = x % 10;
            if (digit % p1 != 0 && digit % p2 != 0)
            {
                count++;
            }
            x /= 10;
        }
    }
    cout << count << endl;
    return 0;
}
